{
  "add_cross_attention": false,
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ADDRESS",
    "2": "I-ADDRESS",
    "3": "B-CREDIT_CARD",
    "4": "I-CREDIT_CARD",
    "5": "B-DATE_TIME",
    "6": "I-DATE_TIME",
    "7": "B-EMAIL_ADDRESS",
    "8": "I-EMAIL_ADDRESS",
    "9": "B-LOCATION",
    "10": "I-LOCATION",
    "11": "B-ORGANIZATION",
    "12": "I-ORGANIZATION",
    "13": "B-PERSON",
    "14": "I-PERSON",
    "15": "B-PHONE_NUMBER",
    "16": "I-PHONE_NUMBER",
    "17": "B-ZIP_CODE",
    "18": "I-ZIP_CODE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-ADDRESS": 1,
    "B-CREDIT_CARD": 3,
    "B-DATE_TIME": 5,
    "B-EMAIL_ADDRESS": 7,
    "B-LOCATION": 9,
    "B-ORGANIZATION": 11,
    "B-PERSON": 13,
    "B-PHONE_NUMBER": 15,
    "B-ZIP_CODE": 17,
    "I-ADDRESS": 2,
    "I-CREDIT_CARD": 4,
    "I-DATE_TIME": 6,
    "I-EMAIL_ADDRESS": 8,
    "I-LOCATION": 10,
    "I-ORGANIZATION": 12,
    "I-PERSON": 14,
    "I-PHONE_NUMBER": 16,
    "I-ZIP_CODE": 18,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.4.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 250002
}
